[   
    {
        "company" : "Ascendeum",
        "position" : "UI Engineer",
        "duration" : "May 2024 - Present", 
        "description" : [
            "Diagnosed and resolved critical performance issues—including excessive DOM rendering and memory leaks—that were breaking the site in production, leading to a significantly more stable and responsive application." , 
            "Integrated live-streaming, real-time charting features into existing data visualization dashboards using efficient rendering techniques and WebSocket-based data pipelines." , 
            "Designed and implemented Redux-based global state management across the application, resolving complex state inconsistencies and improving overall app stability and user experience.",
            "Engineered a real-time multi-user collaborative dashboard, enabling multiple users to simultaneously edit and sync changes live—improving collaboration flow and user engagement.",
            "Developed a Superapps system using React and Micro-Frontends to enable seamless multitasking across apps with preserved context and improved user productivity.",
            "Refactored, modularized, and thoroughly documented a large-scale frontend codebase, significantly improving readability, maintainability, scalability, and ease of onboarding for new developers."
        ]
    },
    {
        "company" : "Kalvium",
        "position" : "Full-Stack Developer / Mentor",
        "duration" : "June 2023 - May 2024", 
        "description" : [
            "Utilized React & NodeJS to develop an attendance management tool, incorporating Redux for state management." , 
            "Mentored 40+ engineering students in their 1st year, helping them secure internships at top MNCs such as Morgan Stanley, Lows, etc., by providing guidance on technical skills, interview preparation, and career development." , 
            "Facilitating hands-on learning through live code-along sessions in DSA and Full-stack development.",
            "Document & track students’ learning journeys to effectively monitor & ensure their progress.",
            "Evaluating students’ projects and providing detailed feedback with specific suggestions for improvement."
        ]
    },
    {
        "company" : "Reliance",
        "position" : "Senior Executive",
        "duration" : "Oct 2022 - Jan 2023", 
        "description" : [ 
            "Enhanced productivity by developing a real-time performance monitoring platform using MERN technology." ,
            "Led a project to optimize cluster picking processes, resulting in a significant 25% productivity increase." ,
            "Led the team while a new cluster-picking method was being implemented in the warehouse." ,
            "Responsible for planning and scheduling 110 associates by taking order forecasts from the salesteam." ,
            "Monitoring, evaluating, and training associates to maintain a high level of productivity and work quality." ,
            "Preparing and presenting reports on productivity and order processing to zonal and city leads."
        ]
    }
]